[
  {
    "title": "Developer / Mentor",
    "company": "Devmountain",
    "date": "August 2021",
    "image": "https://res.cloudinary.com/dchbfnubk/image/upload/f_auto,q_auto/v1/portfolio/wopscqa0lllyziln3atn",
    "highlights": [
      "Mentored students through software development journey",
      "Provided valuable support and advice",
      "Continuously contribute through talks and insights"
    ],
    "description": "While also learning to code and attending Devmountain, I provided mentorship, support, and ongoing contributions to aspiring developers at Devmountain through pair programming, talks, and insights."
  },
  {
    "title": "Software Engineer",
    "company": "Impact Suite",
    "date": "October 2021",
    "image": "https://res.cloudinary.com/dchbfnubk/image/upload/v1706917783/portfolio/fuue8dywlqkj9ofpdy4y.jpg",
    "highlights": [
      "Developed mental health, substance abuse, and parenting support apps.",
      "Promoted to mid-level engineer within first year.",
      "Led frontend development of admin panel."
    ],
    "description": "I was hired as a junior developer but was soon promoted to mid-level full-stack engineer, leading the development of mobile and web applications aimed at improving mental health, addressing substance abuse, and fostering parenting skills, notably leading the frontend design of a robust admin panel."
  },
  {
    "title": "Frontend Engineer",
    "company": "National Processing",
    "date": "November 2022 - Present",
    "image": "https://res.cloudinary.com/dchbfnubk/image/upload/f_auto,q_auto/v1/portfolio/x3ljguevxahb0qgx3v63",
    "highlights": [
      "Led development as lead frontend engineer at National Processing",
      "Developed a new web app and UI library",
      "Expanded expertise to include full-stack responsibilities for seamless user experience"
    ],
    "description": "At National Processing, I took on the lead frontend engineer role, overseeing the development of a new web application and UI library, while also expanding my skills to cover full-stack responsibilities for a cohesive user experience and strong functionality."
  },
  {
    "title": "Full Stack Developer",
    "company": "Paymentbox",
    "date": "October 2023 - Present",
    "image": "https://res.cloudinary.com/dchbfnubk/image/upload/f_auto,q_auto/v1/portfolio/bkgshybmsknhuexsrstx",
    "highlights": [
      "Develop and maintain frontend and backend of Paymentbox",
      "Collaborate with product and design teams for feature implementation and UX enhancement",
      "Contribute to application architecture and performance"
    ],
    "description": "At Paymentbox we are developing new tech for the payment processing world. We are solving unique problems and coming up with inovative solutions. I also work closely with the product and design teams to implement new features and improve the user experience. While also maintaining current applciations, I help contribute to the overall architecture and performance of new projects."
  }
]
