[
  {
    "name": "Clay Olsen",
    "title": "CEO/Founder | Impact Suite",
    "image": "https://res.cloudinary.com/dchbfnubk/image/upload/f_auto,q_auto/v1/portfolio/n4vwssnmgpn0syoikxrw",
    "quote": "Tanner is incredibly talented and amazing to work with. He's a hard worker and is willing to flex when needed. Any team would be lucky to have him!"
  },
  {
    "name": "Cashe Collins",
    "title": "Senior Software Engineer",
    "image": "https://res.cloudinary.com/dchbfnubk/image/upload/f_auto,q_auto/v1/portfolio/dc5e2mfhvhpxtgoeuvun",
    "quote": "Tanner is one of the most talented developers I’ve worked with, and he’s just getting started. If you’re looking for an engineer with rediculous talent, gets along with your whole team, and can take your department to the next level you found your guy in Tanner."
  },
  {
    "name": "Zach Johnson",
    "title": "Product Manager",
    "image": "https://res.cloudinary.com/dchbfnubk/image/upload/f_auto,q_auto/v1/portfolio/xczt6eeupdsqegvtn8lh",
    "quote": "Tanner Thomas is simply amazing! I love this guy. Anyone who has the need for a ridiculously talented engineer please hit him up."
  },
  {
    "name": "Moreya Redmond",
    "title": "Project Manager/Scrum Master",
    "image": "https://res.cloudinary.com/dchbfnubk/image/upload/f_auto,q_auto/v1/portfolio/tqxtfihu0a1q1bmg09nx",
    "quote": "I am grateful to have been able to work with Tanner. Upon joining the team, he quickly adapted, immediately became a valued member, and significantly improved our product. Tanner embodies the agile philosophy, readily providing constructive feedback, and constantly seeking self-improvement and team-improvement. Tanner's cheerful disposition brings a positive, uplifting energy to the team that enhances the overall work environment. His good-natured approach to tasks and challenges contributes to a culture of positivity and resilience, making it easier for the team to navigate through tough situations. He is always thorough in his work, ensuring that every task he undertakes is done to the best of his ability. He is consistent in his efforts, showing up every day ready to give his all. This combination of a positive attitude and strong work ethic makes him an invaluable asset to the team, contributing significantly to team morale, productivity, and the overall quality of work."
  },
  {
    "name": "Colten Tidwell",
    "title": "Director of Marketing",
    "image": "https://res.cloudinary.com/dchbfnubk/image/upload/v1729204901/1593761416667_ygbrmt.jpg",
    "quote": "Tanner is extremely talented, great to work with and overall a solid person. Anyone in my network looking for a solid software engineer, Tanner is great!"
  }
]
